app/controllers/urls_controller.rb

INSERT INTO "urls" ("path", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["path", "https://sites.google.com/view/bilobaba/page-2"], ["comment", "Page 2"], ["created_at", "2018-02-03 17:58:49.951042"], ["updated_at", "2018-02-03 17:58:49.951042"]]
---
  def create
    @url = Url.new(url_params)

    respond_to do |format|
      if @url.save

UPDATE "urls" SET "text_bilobaba" = $1, "date_bilobaba" = $2, "text_diff_html_right" = $3, "text_diff_html_left" = $4, "text_diff_html" = $5, "text_diff" = $6, "updated_at" = $7 WHERE "urls"."id" = $8
---
  def copy
    @url.text_bilobaba = @url.last_scan_text
    @url.date_bilobaba = @url.last_scan_date
    @url.text_diff = @url.text_diff_html = @url.text_diff_html_left = @url.text_diff_html_right = ""
    @url.save

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_url
      @url = Url.find(params[:id])